public class Dzmiddle3 {
    public static void main(String[] args) {
        //тут объеденил два задания 3 и 4
        String s = "Hello Java!";
        System.out.println(s.toUpperCase());
        /**
        Вывести строку в верхнем регистре (то есть заглавными буквами) с помощью операции .toUpperCase()
         */
        System.out.println("Поиск символа 'J' - " + s.indexOf('J'));
        //Найти номер буквы «J» при помощи операции .indexOf()
        System.out.println("Размер строки - " + s.length());
        /**
        Считать с консоли строку и вывести её длину на экран. Для этого воспользуйтесь операцией .length()
         */
    }
}
